<?php
$start = microtime( );     //문서가 실행하는데 걸린 시간 구함
echo "<B> ※ 1부터 1000까지 합을 구하는데 걸린 시간 </B> <br>";
echo "-------------------------------------------------- <br>";
echo " <<<<< 처리 시작 >>>>> <br>  ● start ▶ {$start} <br> ";
$n = 1000;
$sum = 0;
for($c = 1; $c <= $n; $c++)
	$sum += $c;      // $sum = $sum + $c와 같음
echo "-------------------------------------------------- <br>";
echo "  1부터 {$n} 까지의 합 ..... {$sum} <br>";
echo "-------------------------------------------------- <br>";
$end = microtime( );     //문서가 실행되서 계산을 완료할 때까지의 걸린 시간
echo " <<<<<  처리 완료 >>>>> <br> ● end ▶  {$end} <br>";
echo "-------------------------------------------------- <br>";
?>