<?php
echo "<B> ※ 세 자리마다의 기호 표시와 소수점 자리수 지정 </B> <br>";
$a = 12345678.987;
echo "------------------------------------------------------------------------- <br>";
echo " ▶ 변수 \$a = 12345678.987 의 표시와 지정<br>";
echo "------------------------------------------------------------------------- <br>";
echo "1. 세 자리마다 콤마 표시 :   " . number_format($a) . "<br>";
echo " &nbsp; &nbsp; ........ (소수점 자리이하 삭제됨) <br>";
echo "------------------------------------------------------------------------- <br>";
echo "2. 세 자리마다 콤마 표시와 소수점 표시 : ";
echo number_format($a, "2", ".", ",") . "<br>";
echo " &nbsp; &nbsp; ..........(소수점 2자리미만 반올림 됨) <br>";
echo "------------------------------------------------------------------------- <br>";
echo "3. 세 자리마다 @ 표시와 소수점 표시 #기호 : ";
echo number_format($a, "2", "#", "@") . "<br>";
echo " &nbsp; &nbsp; ..........(소수점 2자리미만 반올림 됨) <br> ";
echo "------------------------------------------------------------------------- <br>";
?>