<?php
echo "<B> ※ 배열의 개수를 구하는 count( ), size( )함수 사용  </B> <br>";
echo "----------------------------------------------------------------- <br>";
$a = array ("노트북", "데스크탑", "네비게이션", "PDP", "MP3");
echo " ■ \$a = array (노트북, 데스크탑, 네비게이션, PDP, MP3)<br>";
echo "----------------------------------------------------------------- <br>";
$aco = count($a);
$asi = sizeof($a);
echo " ▶ connt( )함수 사용 ..... <b> {$aco} 개 </b><br>";
echo "----------------------------------------------------------------- <br>";
echo " ▶ sizeof( )함수 사용 ..... <b> {$asi} 개 </b><br>";
?>