<?php

echo "<B> ※ 반환(return) 값과 인자 세 개를 갖는 함수</B> <br>";
echo "-------------------------------------------------- <br>";

function gob($a, $b, $c)      // gob(인자1, 인자2, 인자3)함수 정의
{
	echo " 곱셈 연산을 하는  gob(\$a, \$b, \$c)함수 호출 <br>";
	echo "... {$a} * {$b} * {$c} = ";
	return $a * $b * $c;
}

	$mul = gob(5, 5, 5);
	echo "{$mul} <br>";
	echo "-------------------------------------------------- <br>";

	$mul = gob(10, 100, 1000);
	echo "{$mul} <br>";
	echo "-------------------------------------------------- <br>";

?>