<?php

echo "<B> ※ 단방향 암호화 crypt( )함수 적용</B> <br>";
echo "-------------------------------------------------------------------------------- <br>";

$char = "ok8563";
echo " ■ 암호화가 안된 비밀번호 : {$char} <br><br>";

$passwd = crypt($char, '');
echo " ■ 암호화된 비밀번호 : {$passwd} <br>";
echo "-------------------------------------------------------------------------------- <br>";

$inpw = "ok8563";
if(crypt($inpw, $passwd) == $passwd)
{
	echo " ■ 비밀번호가 일치하는지를 알아보기 위한 if문 <br><br>";
	echo " ★★ welcome !!! 비밀번호 확인 완료 !!! welcome ★★<br>";
	echo "-------------------------------------------------------------------------------- <br>";
}
else
{
	echo " ??? 비밀번호가 틀렸습니다... ??? <br>";
	echo " !!! 다시 확인하시기 바랍니다... !!! <br>";
}

?>