<?php

echo "<B> ♣ array( )함수를 이용한 5개 과목의 총점, 평균 </B><br>";
echo "--------------------------------------------- <br>";

$score = array(85, 93, 77, 69, 98);                  

$sum = 0;          // 총점

for($c = 0; $c <=4; $c++)
{	
	$sum += $score[$c];      // $sum = $sum + $score[$c] 와 같음
	$cnt = $c+1;      // 0번째가 아니라 1번째부터 표시
	echo " {$cnt} 번째 과목점수 :  $score[$c] ... ( 누적합 = {$sum} ) <br>";
}

$avg = $sum/5;   // 평균

echo "-------------------------------------------- <br>";
echo " ▶ 5과목총점 ..... {$sum} <br> ";
echo " ▶ 5과목평균 ..... {$avg} <br>";
echo "-------------------------------------------- ";

?>