<?php
echo "<B> ※ 특정 문자를 다른 문자로 변경하는 함수 사용 </B> <br>";
$a = " Hi speed ";
$b = str_replace("H", " ", $a);
$c = str_replace("ed", "ak", $a);
echo "--------------------------------------------------------- <br>";
echo " ▶ 제시된 문자열 ............................ <b> \"{$a}\" </b> <br>";
echo "--------------------------------------------------------- <br>";
echo " 1. str_replace(\"H\", \" \", \$a) 의 결과 .........  <b> {$b} </b><br>";
echo " 2. str_replace(\"ed\", \"ak\", \$a) 의 결과 ...  <b> {$c} </b>";
?>